In [10]:
import pandas as pd

In [11]:
df = pd.read_json('datos.json')
display(df)

  Nombre  Edad     Ciudad
0    Ana    23     Madrid
1   Juan    45  Barcelona
2  Pedro    34   Valencia

In [18]:
#hay problemas, esto no funciona
from io import StringIO

#JSON con comillas dobles correctas
json_data = """
{
    "Nombre": ["Ana", "Juan", "Pedro"],
    "Edad": [23, 45, 34],
    "Ciudad": ["Madrid", "Barcelona", "Valencia"]
}
"""

#Convertimos el string en archivo temporal
dfjson = pd.read_json(StringIO(json_data))
display(dfjson)

  Nombre  Edad     Ciudad
0    Ana    23     Madrid
1   Juan    45  Barcelona
2  Pedro    34   Valencia

In [19]:
df.to_json('datos_exportados.json', orient='records', lines=True)

In [21]:
df.to_json('datos_identados.json', orient='records', lines=True, indent=4)

In [22]:
df.to_json('datos_precision.json', double_precision=2, orient='records')

In [23]:
df = pd.DataFrame({
    "Nombre": ["Ana", "Juan"],
    "Datos": [{"Edad": 23, "Ciudad": "Madrid"}, {"Edad": 45, "Ciudad": "Barcelona"}]
})

display(df)

  Nombre                                Datos
0    Ana     {'Edad': 23, 'Ciudad': 'Madrid'}
1   Juan  {'Edad': 45, 'Ciudad': 'Barcelona'}

In [24]:
df.to_json('datos_anidados.json', orient='records')